Repository: benced/anarchotv
Catalog: drupal5/sites/all/modules/file_import/po/*.po
Languages: ru

source: File import
ru: Импорт файлов

source: Import multiple files and save them as node attachments. The files will be moved from their default location.
ru: Вы можете импортировать множество файлов за раз, сохраняя их прикрепленными к материалам сайта.

source: Searching for files in %dirpath.
ru: Файлы импортируются из %dirpath.

source: Import path
ru: Импортировать из

source: The directory to import files from. Drupal will need to have write access to this directory so we can move the file.
ru: Директория, из которой будем импортировать. Drupal'у нужно иметь права на запись в этой директории для корректной работы модуля.

source: <strong>Note:</strong> a path begining with a <kbd>/</kbd> indicates the path is relative to the server's root, not the website's root. One starting without a <kbd>/</kbd> specifies a path relative to Drupal's root. For example: <kbd>/tmp/image</kbd> would be the temp directory off the root while <kbd>tmp/image</kbd> would be inside Drupal's directory.
ru: <strong>Примечание:</strong> путь, который начинается со слеша <kbd>/</kbd> означает путь, относительно корня файловой системы сервера, а не корня сайта.

source: Import to nodes which has permission to contain files only
ru: Импортировать только в материалы, которые могут иметь прикрепленные файлы.

source: Configure the files import module's settings.
ru: Настройки модуля импорта фалов.

source: No files in import directory
ru: Директория импорта пуста.

source: You can set target node to a bunch of selected files at once.
ru: Вы можете выставить ID для нескольких строк сразу.

source: Select node from list below and press button to set the values.
ru: Выберите ID из списка и нажмите кнопку, чтобы выставить значения.

source: ID - Title
ru: ID - Заголовок

source: Set for selected rows
ru: Установить для выделенных

source: Clear selected titles
ru: Удалить заголовки в выделенном

source: Capitalize first letter
ru: Первая заглавная буква

source: Capitalize all words
ru: Все заглавные буквы

source: RegEx replacement in titles
ru: RegEx Замена в заголовках

source: Target node ID
ru: ID материала, в который импортируем

source: Output path
ru: Сохранять в

source: The directory to output files to. Drupal will need to have write access to this directory so we can move the file.
ru: Директория, в которую будем импортировать. Drupal'у нужно иметь права на запись в этой директории для корректной работы модуля.

source: Display tab on node pages
ru: Показывать вкладку на страницах материалов

source: Replace from
ru: Заменить это

source: Replace to
ru: на

source: Clear titles
ru: Очистить заголовки
